# ~/code/personal/my-shell-my-rules/brew/15-nice-to-haves/Brewfile
# Nice to have apps
# Usage: brew bundle --file=~/code/personal/my-shell-my-rules/brew/15-nice-to-haves/Brewfile

tap "xykong/tap"

# Mac App Store CLI — needed for `mas` lines below
brew "mas"

# Keep Mac awake — menubar toggle, prevents sleep/display-off
# Mac App Store only; requires being signed into the App Store before `brew bundle`
mas "Amphetamine", id: 937984704

# Spotlight replacement — app launcher, clipboard history, snippets
cask "raycast"

# External monitor resolution and brightness control
# Cask tracks the latest GitHub release — no special flags needed
cask "betterdisplay"

# Microsoft Remote Desktop
cask "windows-app"

# API testing
cask "postman"

# Discord
cask "discord"

# App subscription service
cask "setapp"

# Input customization — trackpad gestures, macros, keyboard remapping
cask "bettertouchtool"

# Screenshot tool — annotate, OCR, scrolling capture, record
cask "cleanshot"

# Menubar mini calendar — click to see month view
cask "itsycal"

# Window snapping — keyboard shortcuts + drag-to-edge snap regions
cask "rectangle"

# Mouse customization — remap buttons, scroll speed, per-app behavior
cask "linearmouse"

# Markdown editor with live preview
cask "xykong/tap/flux-markdown"

# supacode
cask "supacode"
