# ~/code/personal/my-shell-my-rules/brew/10-essential/Brewfile
# Daily driver tools
# Usage: brew bundle --file=~/code/personal/my-shell-my-rules/brew/10-essential/Brewfile

tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"   # icon-only Nerd Font (used as kitty symbol_map fallback)
cask "sf-symbols"

# Languages
brew "go"
brew "deno"

# Node package managers
brew "pnpm"

# JS/TS tooling
brew "biome"             # fast formatter + linter (replaces ESLint + Prettier in modern stacks)

# Go tooling
brew "gopls"             # Go language server (LSP)
brew "delve"             # Go debugger
brew "staticcheck"       # Go static analysis
brew "golang-migrate"    # database migrations
go "golang.org/x/tools/cmd/goimports"   # Go import formatter
go "go.uber.org/mock/mockgen"            # Go mock generator

# Dev tools
brew "gh"                # GitHub CLI
brew "awscli"            # AWS CLI
brew "glab"              # GitLab CLI
brew "gitlab-runner"     # run GitLab CI pipelines locally
cask "1password"         # password manager app
brew "1password-cli"     # op CLI — biometric unlock after connecting in app settings
# NOTE: pgvector is NOT installed via brew. Brew's formula builds against brew's postgres
# and drops its .so into brew's install tree, which pgenv-managed postgres never loads.
# We build pgvector from source in scripts/pgenv-setup.sh, pointed at pgenv's pg_config.
brew "git-delta"         # beautiful git diffs
brew "vivid"             # generates LS_COLORS palettes for zsh/fzf-tab completion coloring
brew "neovim"            # text editor — using kickstart.nvim config (beginner-friendly)
brew "btop"              # system monitor
brew "FelixKratz/formulae/sketchybar"  # custom macOS status bar replacement
brew "jesseduffield/lazygit/lazygit"
brew "fastfetch"         # system info on shell start
# kanata — NOT available via brew (cmd_allowed variant required, brew build lacks it)
# Install manually: see README post-installation steps
brew "switchaudio-osx"   # CLI audio source switcher, used by kanata AirPods chord
cask "karabiner-elements" # provides the virtual HID driver required by kanata

# Kubernetes & DevOps
brew "helm"
brew "kubernetes-cli"
brew "argo"              # Argo Workflows CLI
brew "argocd"            # Argo CD CLI — GitOps continuous delivery

# Cloud
cask "google-cloud-sdk"  # gcloud CLI
cask "tailscale"         # VPN

# Finder customization
brew "fileicon"            # set custom folder/file icons from CLI
brew "mysides"             # manage Finder sidebar items from CLI

# Apps
cask "obsidian"
cask "google-chrome"
cask "zen-browser"
cask "slack"
cask "visual-studio-code"
cask "figma"

# VS Code extensions
vscode "dbaeumer.vscode-eslint"
vscode "github.copilot-chat"
vscode "pomdtr.excalidraw-editor"
vscode "unional.vscode-sort-package-json"
